<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!-- saved from url=(0043)https://dpt-info.u-strasbg.fr/~magaud/UFAZ/ -->
<html><script type="text/javascript">window["_gaUserPrefs"] = { ioo : function() { return true; } }</script><head><meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
    <title>Habilitation &agrave; diriger des recherches - Nicolas MAGAUD - 6 novembre 2020</title>
  </head>
<body <body="" text="#0000FF" bgcolor="#FFFFFF" link="#009900" vlink="#FF6600" alink="#990000" background="../back-c.gif">
    <center><h1>Habilitation &agrave; diriger des recherches</h1></center>
<hr>
<h2>Contributions au d&eacute;veloppement des m&eacute;thodes formelles de preuves et
applications &agrave; la g&eacute;om&eacute;trie</h2>


    <ul>
      <li> Habilitation soutenue le 06 novembre 2020 &agrave; l'Universit&eacute; de Strasbourg<p>
      <li> <a href="HDR_MAGAUD.pdf">m&eacute;moire d'habilitation &agrave; diriger des recherches</a><p>
      <li> <a href="soutenance_MAGAUD.pdf">support de pr&eacute;sentation</a><p>
	<li>jury d'habilitation : <p>
<table class="wp-table">
<tr>
      <td><a href="http://www.lsv.fr/~dowek/">Gilles Dowek</a></td>
      <td>Directeur de recherche, INRIA Paris-Saclay</td>
      <td>Rapporteur</td>
    </tr>
   
    <tr>
      <td><a href="https://www.inf.ed.ac.uk/people/staff/Jacques_Fleuriot.html">Jacques Fleuriot</a></td>
      <td>Professeur, Universit&eacute; d'Edimbourg</td>
      <td>Rapporteur</td>
    </tr>
    <tr>
      <td><a href="https://lib.u-bourgogne.fr/equipe/michelucci-dominique">Dominique Michelucci</a></td>
      <td>Professeur, Universit&eacute; de Bourgogne</td>
      <td>Rapporteur</td>
    </tr>
    <tr>
      <td><a href="http://icps.u-strasbg.fr/people/bastoul/public_html/">C&eacute;dric Bastoul</a></td>
      <td>Professeur, Universit&eacute; de Strasbourg, directeur scientifique chez Huawei France</td>
      <td>Examinateur</td>
    </tr>
    <tr>
      <td><a href="http://web4.ensiie.fr/~dubois/">Catherine Dubois</a></td>
      <td>Professeur, ENSIIE Evry</td>
      <td>Examinateur</td>
    </tr>

        <tr>
      <td><a href="https://sites.google.com/site/pascalschreck/">Pascal Schreck</a></td>
      <td>Professeur, Universit&eacute; de Strasbourg</td>
      <td>Garant d'habilitation</td>
    </tr>

</table>

	<li>r&eacute;sum&eacute;:<p>

L'utilisation des assistants de preuve comme Coq prend de plus en plus d'ampleur. De tels outils permettent de d&eacute;montrer formellement aussi bien des r&eacute;sultats math&eacute;matiques que des propri&eacute;t&eacute;s de correction d'algorithmes et de programmes informatiques. La g&eacute;om&eacute;trie est un domaine d'application riche et bien adapt&eacute; pour mettre &agrave; l'&eacute;preuve ces syst&egrave;mes d'aide &agrave; la preuve. Dans nos travaux, nous nous int&eacute;ressons &agrave; trois domaines sp&eacute;cifiques de la g&eacute;om&eacute;trie : la formalisation d'algorithmes g&eacute;om&eacute;triques, l'automatisation au moins partielle des d&eacute;monstrations dans le cadre de la g&eacute;om&eacute;trie projective et enfin la mod&eacute;lisation des nombres r&eacute;els dans un formalisme bien adapt&eacute; &agrave; la g&eacute;om&eacute;trie discr&egrave;te.<p>

Nos premiers travaux en g&eacute;om&eacute;trie ont permis de d&eacute;montrer dans Coq la correction de deux variantes de l'algorithme incr&eacute;mental de calcul de l'enveloppe convexe d'un ensemble de points du plan en utilisant une approche topologique avec les cartes combinatoires. Ces travaux ont mis en &eacute;vidence le besoin de disposer d'outils pour automatiser au moins partiellement les d&eacute;monstrations en g&eacute;om&eacute;trie. Nous avons alors &eacute;tudi&eacute; cette question dans le cadre simple de la g&eacute;om&eacute;trie projective en utilisant une approche combinatoire et la notion de rang d'un ensemble de points. L'outil propos&eacute; permet de d&eacute;montrer automatiquement de nombreux th&eacute;or&egrave;mes embl&eacute;matiques de la g&eacute;om&eacute;trie projective et de produire une trace sous la forme d'un script de preuve v&eacute;rifiable par Coq. Enfin, faire des preuves en g&eacute;om&eacute;trie, qu'elles soient automatis&eacute;es ou non, ne peut se faire sans disposer d'un mod&egrave;le informatique des nombres r&eacute;els. Nous avons formalis&eacute; dans Coq la droite d'Harthong-Reeb qui est un mod&egrave;le du continu ainsi que son implantation informatique avec les entiers de Laugwitz-Schmieden. Ce mod&egrave;le est bien adapt&eacute; au contexte de la g&eacute;om&eacute;trie discr&egrave;te et permet notamment de repr&eacute;senter facilement des objets continus de mani&egrave;re discr&egrave;te en utilisant un sch&eacute;ma d'arithm&eacute;tisation.<p>

Nos travaux ont un double objectif. Il s'agit d'une part de confronter notre expertise en preuves formelles &agrave; des probl&egrave;mes issus de nouveaux domaines et de d&eacute;montrer que les outils dont nous disposons sont bien adapt&eacute;s &agrave; la r&eacute;alisation de preuves formelles, notamment en g&eacute;om&eacute;trie. D'autre part, de tels travaux permettent de mettre en &eacute;vidence les points d'am&eacute;lioration des outils existants et &eacute;ventuellement d'en accroître la fiabilit&eacute;, l'efficacit&eacute; et la facilit&eacute; d'utilisation.
    </ul>
   
    

<hr>
    <address><a href="mailto:magaud@unistra.fr">Nicolas Magaud</a></address>
<!-- Created: Tue Feb  1 10:06:38 CET 2011 -->
<!-- hhmts start -->Last modified: Mon Nov  9 10:57:18 CET 2020 <!-- hhmts end -->
  



</body></html>
